#
### please run "brew bundle"
#
tap "homebrew/bundle"

# shell
brew "fzf"
brew "grep"
brew "jq"
brew "kustomize"
brew "neovim"
brew "tmux"
brew "wget"
brew "zsh"
brew "procs"
brew "exa"
brew "bat"
brew "fd"

# language
brew "lsd"
brew "nvm"
brew "node"
brew "yarn"
brew "go"
brew "deno"

# tool
brew "terraform"

# extentions
brew "git-delta"
brew "peco"

# command
brew "tree"

# app
cask "alt-tab"
cask "visual-studio-code"
cask "warp"

